{
   "projects": [
      {
         "id": 0,
         "name": "United Airlines",
         "route": {
            "path": "/united",
            "comp": "United"
          },
         "type": "DIGITAL",
         "description": "As senior developer at McGarryBowen Chicago we worked with the New York creative and account teams to create multiple digital out of home pieces for United Airlines. My role was development and animation using dynamic API data sources to communicate there message. Built with HTML5 technologies running on a chromeless version of the Google Chrome browser on billboards and other digital displays.",
         "bgPath": "images/Samsung/bgImage.jpg",
         "bgColor": "#031936",
         "video": "//player.vimeo.com/video/352075107",
         "images": "UnitedOOH/United_1.jpg,UnitedOOH/United_2.jpg,UnitedOOh/kiosk_gif_street.gif",
         "imageCopy": "Utilizing the Nj Transit API to get real time train station departure and arrival times. We created an airport style departure board using HTML5 Technologies. The billboards job was to communicate that you could travel from Penn Station to Newark airport in under 25 minutes on the NJ transit., We created multiple messages to communicate different promotions and travel times. Using map data and time data which allowed us to show time differences and count down timers to communicate promotions and travel information in real time., Working closely with the United creative team to create the feel and direction of the campaigns animation. These were not only displayed all over the sidewalks of New York City but where also used as animation direction for vendors and production partners. Using various online maps data to calculate the time differences from driving to either JFK or EWR from their current location.,",
         "imageHeaders": "New Jersey Transit, Multiple Messages, Wi-Fi Kiosks,",
         "link": "",
         "viewed": false
      },
      {
         "id": 1,
         "name": "Marriott Hotels",
         "route": {
            "path": "/marriott",
            "comp": "Marriott"
          },
         "type": "WEB",
         "description": "McGarryBowen works with several Marriott brands including SpringHill Suites, Residences Inn, Fairfield Inn, Courtyard, and TownePlace Suites. As senior developer I worked on website development and maintenance, rich media executions, and standard media campaigns across the Marriott brands. As well as consulting with producers and creatives to deliver the best possible solution to the creative and technical problems at hand.",
         "bgPath": "images/TownePlaceSuites/bgImage.jpg",
         "bgColor": "#d2252f",
         "video": "",
         "images": "TownePlaceSuites/tps_1.jpg,TownePlaceSuites/tps_2.jpg,TownePlaceSuites/tps_3.jpg,TownePlaceSuites/tps_4.jpg,TownePlaceSuites/tps_5.jpg,TownePlaceSuites/tps_6.jpg",
         "imageCopy": "TownePlace Suites | While many of the brands sites were built and maintained by different developers over the years. I developed TownePlace Suites from the ground up as well as overall site maintenance and content updates. We were also tasked with making everything fully ADA compliant along with the other Marriott brands at McGarryBowen.,Additional Features | We created interactive features to showcase TownPlace Suites offerings.  As well as showcasing unique partnerships that enhance the customers stay at TownPlace Suites such as recipes for grilling on a Weber Grill. And Travel packing tips while utilizing your rooms Container Store closet systems.,,,,Responsive And Adaptive | TownePlace suites is not only built to be responsive across all standard devices but is also adaptive to deliver content in a way that best fits your devices screen size.,",
         "imageHeaders": "TownePlace Suites, Additional Features,,,,Responsive And Adaptive,",

         "link": "https://towneplacesuites.marriott.com",
         "viewed": false
      },
      {
         "id": 2,
         "name": "Kraft Singles",
         "route": {
            "path": "/kraft",
            "comp": "Kraft"
          },
         "type": "WEB",
         "description": "Being one of my first projects at McgarryBowen Chicago I worked closely with creative and design to create a small micro site that educated consumers on the nutritional facts of Kraft Singles.",
         "bgPath": "images/KraftSingles/bgImage.jpg",
         "bgColor": "#011835",
         "video": "",
         "images": "KraftSingles/KraftSingles_1.jpg,KraftSingles/KraftSingles_2.gif,KraftSingles/KraftSingles_3.jpg",
         "imageCopy": "Know Your Singles | Working from an existing rapid prototype we created a small site to let consumers know that Kraft Single have nothing artificial. Translated into English and Spanish to reach all of Kraft singles range of customers.,,Responsive | The site was developed to look and function great across all modern devices. Adapting to the device it is on the contents design changes to function best on desktop or mobile. Creating an experience which works for the consumer however they may access it.,",
         "imageHeaders": "Know Your Singles,,Responsive,",
         "link": "",
         "viewed": false
      },
      {
         "id": 3,
         "name": "Delve",
         "route": {
            "path": "/delve",
            "comp": "Delve"
          },
         "type": "DIGITAL",
         "description": "We were asked internally to make something for the touch screen that lives in the Chicago Razorfish office. Utilizing html5 technologies powered by Google Chrome we created delve. I was the lead developer, designer, and part of the concept team. This project was featured by Leap Motion and Adobe.",
         "bgPath": "images/Delve/bgImage.jpg",
         "bgColor": "#185651",
         "video": "//player.vimeo.com/video/83541285",
         "images": "Delve/Delve_971211354.jpg,Delve/Delve_778167679.jpg,Delve/Delve_2133386092.jpg,Delve/Delve_1347878584.jpg,Delve/Delve_608819232.jpg,Delve/Delve_1709247450.jpg,Delve/Delve_1428768471.jpg,Delve/Delve_1803741805.jpg,Delve/Delve_1154737376.jpg,Delve/Delve_123396345.jpg",
         "imageCopy": "Delve In | Built to be fully expandable I created a library on top of threeJs that allowed for easy updating of additional 3D worlds. Incorporating social and other web technologies we were able to create a story with fun hidden interactions.,,,,,,,,Weather Permitted | Utilising weather API data the environments adjusted to the current weather conditions. Particles created rain&#44; snow&#44; and wind. The amount of clouds in the environment depended on the cloudiness of the day. Fog rolled in depending on the current visibility and it reflected the sunrise and sunset. It became a fun way to check the weather.,",
         "imageHeaders": "Delve In,,,,,,,,Weather Permitted,",
         "link": "",
         "viewed": false
      },
      {
         "id": 4,
         "name": "Chicago Distilling Co",
         "route": {
            "path": "/chicago",
            "comp": "Chicago"
          },
         "type": "WEB",
         "description": "Chicago Distilling Co&#039;s previous website made the company feel more like a bar. After meeting with the owners and giving my initial thoughts, I was asked to help them better convey there business online.",
         "bgPath": "images/ChicagoDistillingCo/bgImage.jpg",
         "bgColor": "#000000",
         "video": "",
         "images": "ChicagoDistillingCo/ChicagoDistillingCo_1536313446.jpg,ChicagoDistillingCo/ChicagoDistillingCo_1579565204.jpg,ChicagoDistillingCo/ChicagoDistillingCo_493670930.jpg,ChicagoDistillingCo/ChicagoDistillingCo_1384442285.jpg,ChicagoDistillingCo/ChicagoDistillingCo_1189727175.jpg,ChicagoDistillingCo/ChicagoDistillingCo_366132029.jpg",
         "imageCopy": "Home Page | Working from the existing brand I restructured the sites code in a module format for easier updates to the site overall. As well as redesigning elements to allow for better mobile design through adaptive approaches. Adding a more traditional site footer to allow for general information and newsletter sign up through there Constant Contact account API. Also added other features such as social sharing buttons_ existing bug fixes_ and other type/design changes.,Social Feeds | I added a section to their home page to allow for the site to pull in Instagram and Twitter feeds directly into there site. The tab based designed loads in the content via APIs using ajax to keep it simple in function. Allowing for Chicago Distilling to post content on the go and better keep their customers in the know of events&#44; product releases&#44; and general happenings at the distillery.,Products | One problem they were experiencing was being in a hot bar block in Chicago and people assuming they are a bar. To solve the problem on the web I created a template landing page for their products  to highlight Chicago Distilling&#039;s current and future line of products. Giving the spirits a strong presence on there site highlighting the idea of spirits manufacturer and not so much on the brick and mortar location. With a cool interactive make a cocktail video feature in the works.,,WordPress | To allow the owners to update content relating to press_ events_ products_ and general news I installed Wordpress. Using WordPress as a classic blog format I created a classic blog theme to match there brand. As well as designed and built out a shopping cart using third party vendor FoxyCart integrated into WordPress. This allows for easy updates with a small learning curve as well as easily adding many features in the future that is part of WordPress and its many plug-ins.,Responsive For Mobile | There old site was set to basically shrink the desktop site down to fit on a mobile device. While this approach technically works_ It is difficult to navigate and can be frustrating to a user now being accustomed to a site designed for small screens. I redesigned parts of the there existing site to allow for better responsive mobile design. As well as designed all their new landing pages and content with mobile responsiveness in mind. Allowing for there entire site to reformat for an overall better mobile experience.",
         "imageHeaders": "Home Page,Social Feeds,Products,,WordPress,Responsive For Mobile",
         "link": "",
         "viewed": false
      },
      {
         "id": 5,
         "name": "Samsung",
         "route": {
            "path": "/samsung",
            "comp": "Samsung"
          },
         "type": "MEDIA",
         "description": "As my role of senior designer/developer I worked alongside the Razorfish Austin office to animate and develop rich media and media campaigns for Samsung mobile phone hardware. Including Youtube.com mast heads, push downs, in page, and standard media.",
         "bgPath": "images/Samsung/bgImage.jpg",
         "bgColor": "#a4b6c4",
         "video": "",
         "images": "Samsung/Samsung_688313199.jpg,Samsung/Samsung_1722020679.jpg,Samsung/Samsung_320023807.jpg,Samsung/Samsung_74219366.jpg,Samsung/Samsung_809657515.jpg,Samsung/Samsung_1040137896.jpg,Samsung/Samsung_435498403.jpg",
         "imageCopy": ",,,,,,",
         "imageHeaders": ",,,,,,",
         "link": "",
         "viewed": false
      },
      {
         "id": 6,
         "name": "Lunchables",
         "route": {
            "path": "/lunchables",
            "comp": "Lunchables"
          },
         "type": "WEB",
         "description": "At Razorfish we created a lot of fun stuff to promote the Lunchable&#039;s brand towards kids. I worked as senior designer, animator, and developer on some entertaining interactive projects. Including micro sites and online contest sites which were integrated into existing vendor frameworks.",
         "bgPath": "images/Lunchables/bgImage.jpg",
         "bgColor": "#291f1d",
         "video": "",
         "images": "Lunchables/Lunchables_874118567.jpg,Lunchables/Lunchables_1802462285.jpg,Lunchables/Lunchables_1520299939.jpg,Lunchables/Lunchables_1619748692.jpg,Lunchables/Lunchables_354107318.jpg,Lunchables/Lunchables_1618293126.jpg,Lunchables/Lunchables_1411152721.jpg,Lunchables/Lunchables_2076684449.jpg",
         "imageCopy": "Project Potential | I worked as lead senior motion designer_ animator_ and developer on Lunchables contest promotional microsite.,,,,,Lunchables Fort | Senior motion designer_ animator_ and developer on Lunchables microsite for kids. Included developing additional features_ build out of landing pages_ and animating elements.,,",
         "imageHeaders": "Project Potential,,,,,Lunchables Fort,,",
         "link": "",
         "viewed": false
      },
      {
         "id": 7,
         "name": "Forza",
         "route": {
            "path": "/forza",
            "comp": "Forza"
          },
         "type": "MEDIA",
         "description": "Working with Razorfish Portland to create over 30 rich media units utilizing Microsoft flash talking online advertising technology. I animated and developed 3 phases of rich media for the launch of the Xbox One and headliner game Forza 5 for the 2013 holiday season.",
         "bgPath": "images/Forza/bgImage.jpg",
         "bgColor": "#064f06",
         "video": "",
         "images": "Forza/Forza_1863067667.jpg,Forza/Forza_1218810275.jpg,Forza/Forza_935255620.jpg,Forza/Forza_864505425.jpg,Forza/Forza_162782820.jpg,Forza/Forza_523785142.jpg,Forza/Forza_1419092057.jpg,Forza/Forza_1095864762.jpg,Forza/Forza_1163135272.jpg,Forza/Forza_529620125.jpg,Forza/Forza_1044255532.jpg",
         "imageCopy": ",,,,,,,,,,",
         "imageHeaders": ",,,,,,,,,,",
         "link": "",
         "viewed": false
      },
      {
         "id": 8,
         "name": "Blackberry Playbook",
         "route": {
            "path": "/blackberry",
            "comp": "Blackberry"
          },
         "type": "MEDIA",
         "description": "As a senior designer/developer on the Blackberry account team I worked alongside the creative team utilizing design, development, and animation skills. We created online campaigns for the release of all Blackberry hardware including the Torch and Playbook tablet.",
         "bgPath": "images/BlackberryPlaybook/bgImage.jpg",
         "bgColor": "#001124",
         "video": "",
         "images": "BlackberryPlaybook/BlackberryPlaybook_599117341.jpg,BlackberryPlaybook/BlackberryPlaybook_1850423892.jpg,BlackberryPlaybook/BlackberryPlaybook_965374807.jpg,BlackberryPlaybook/BlackberryPlaybook_494288564.jpg,BlackberryPlaybook/BlackberryPlaybook_455657319.jpg,BlackberryPlaybook/BlackberryPlaybook_1770528302.jpg",
         "imageCopy": "PlayBook Rich Media | A pushdown rich media unit utilizing Google&#039;s Double Click advertising platform. Using external interface upon expanding to call a javascript function the unit switched CNN’s style sheet to black out the entire site.,,,,Torch Landing Page | A promotional landing page for the launch of the Blackberry Torch that lived on blackberry.com.,",
         "imageHeaders": "PlayBook Rich Media,,,,Torch Landing Page,",
         "link": "",
         "viewed": false
      },
      {
         "id": 9,
         "name": "Fuse",
         "route": {
            "path": "/fuse",
            "comp": "Fuse"
          },
         "type": "WEB",
         "description": "Working directly with former Juxt Interactive executive creative director I was tasked to create a landing page for the band Flogging Molly. With the concept of punk rock leprechauns I illustrated and designed this fun little experience to live on just for the f of it for the Fuse television network.",
         "bgPath": "images/Fuse/bgImage.jpg",
         "bgColor": "#757a64",
         "video": "",
         "images": "Fuse/Fuse_1588141831.jpg,Fuse/Fuse_862403822.jpg,Fuse/Fuse_1781203105.jpg",
         "imageCopy": ",,",
         "imageHeaders": ",,",
         "link": "",
         "viewed": false
      },
      {
         "id": 10,
         "name": "Bank Of America",
         "route": {
            "path": "/boa",
            "comp": "Boa"
          },
         "type": "INTERACTIVE",
         "description": "While at Axcept Media we created this interactive presentation for Bank Of America. The goal was to educate employees of various career levels of available options in their employer provided health care plans. My role included art direction, design, and development.",
         "bgPath": "images/BankOfAmerica/bgImage.jpg",
         "bgColor": "#200f07",
         "video": "",
         "images": "BankOfAmerica/BankOfAmerica_12610023.jpg,BankOfAmerica/BankOfAmerica_69538467.jpg,BankOfAmerica/BankOfAmerica_810480743.jpg,BankOfAmerica/BankOfAmerica_552784044.jpg,BankOfAmerica/BankOfAmerica_290143317.jpg,BankOfAmerica/BankOfAmerica_1245746612.jpg,BankOfAmerica/BankOfAmerica_1244477426.jpg",
         "imageCopy": ",,,,,,",
         "imageHeaders": ",,,,,,",
         "link": "",
         "viewed": false
      },
      {  
         "id": 11,
         "name":"Roots Skateboards",
         "route": {
            "path": "/roots",
            "comp": "Roots"
          },
         "type":"VARIOUS",
         "description":"Working with a small skateboard company out of Minneapolis Minnesota. Collaborating with the company owners to create graphics and illustrations for skateboards and other company products and marketing material including textiles, skateboard wheels, web design/development, and print promotional materials.",
         "bgPath":"images/RootsSkateboards/bgImage.jpg",
         "bgColor":"#443700",
         "video":"",
         "images":"RootsSkateboards/RootsSkateboards_1644197216.jpg,RootsSkateboards/RootsSkateboards_1175755419.jpg,RootsSkateboards/RootsSkateboards_1349137497.jpg,RootsSkateboards/RootsSkateboards_1038827218.jpg,RootsSkateboards/RootsSkateboards_1860021792.jpg",
         "imageCopy":",,,,",
         "imageHeaders": ",,,,",
         "link": "",
         "viewed": false
      },
      {
         "id": 12,
         "name": "Divvy Data Contest",
         "route": {
            "path": "/divvy",
            "comp": "Divvy"
          },
         "type": "WEB",
         "description": "The data team at Razorfish Chicago got together to make a small data visualization for the Chicago Divvy data contest. I joined in last minute to design and develop an interactive map showing data of Divvy users after dark. With a couple days to get something together we did not win but got honorable mention for most beautiful presentation.",
         "bgPath": "images/DivvyDataContest/bgImage.jpg",
         "bgColor": "#01062c",
         "video": "",
         "images": "DivvyDataContest/DivvyDataContest_1088793235.jpg,DivvyDataContest/DivvyDataContest_1136431953.jpg,DivvyDataContest/DivvyDataContest_2145729303.jpg,DivvyDataContest/DivvyDataContest_2026775220.jpg",
         "imageCopy": ",,,",
         "imageHeaders": ",,,",
         "link": "",
         "viewed": false
      },
      {
         "id": 13,
         "name": "My Wedding",
         "route": {
            "path": "/wedding",
            "comp": "Wedding"
          },
         "type": "VARIOUS",
         "description": "Wedding",
         "bgPath": "",
         "bgColor": "#173f1c",
         "video": "",
         "images": "Wedding/wedding_1.jpg",
         "imageCopy": ",",
         "imageHeaders": ",",
         "link": "",
         "viewed": false
      }
   ]
}